# Message text
start_created = '''Привет, {first_name}!
Добро пожаловать в бот по заказу тортов. Нажми "Авторизация" чтобы присоединиться'''
start_not_created = '''С возвращением, {first_name}!
Авторизируйтесь для продолжения'''
need_auth = 'Для использования бота необходимо предоставить свои данные. Так же просьба ознакомиться с соглашением ' \
            'о конфиденциальности'
name = 'Введите свое имя'
phone = 'Введите свой номер телефона'



# Button text
start_button_text = ['Авторизация']
