# Message text
start_created = '''Привет, {first_name}!
Добро пожаловать в бот по заказу тортов. Нажми "Авторизация" чтобы присоединиться'''
start_not_created = '''С возвращением, {first_name}!
Авторизируйтесь для продолжения'''
need_auth = 'Для использования бота необходимо предоставить свои данные. Так же просьба ознакомиться с соглашением ' \
            'о конфиденциальности'
name = 'Введите свое имя'
phone = 'Введите свой номер телефона в международном формате (+71234567890)'
user_saved = 'Ваши данные сохранены'
choose_option = 'Выберете действие'
correct_phone = 'Это не похоже на номер телефона. Введите номер в международном формате (+71234567890)'
admin = 'Вы вошли с правами администратора'
cancel_text = 'Выход в главное меню'

# Button text
start_button_text = ['Авторизация']
main_menu_button_text = ['Заказать', 'Проверить заказ', 'История заказов', 'Контакты']

