# Message text
start_created = '''Привет, {first_name}!
Добро пожаловать в бот по заказу тортов. Нажми "Авторизация" чтобы присоединиться'''
start_not_created = '''С возвращением, {first_name}!
Авторизируйтесь для продолжения'''
need_auth = 'Для использования бота необходимо предоставить свои данные. Так же просьба ознакомиться с соглашением ' \
            'о конфиденциальности'
name = 'Введите свое имя'
phone = 'Введите свой номер телефона в международном формате (+71234567890)'
user_saved = 'Ваши данные сохранены'
choose_option = 'Выберете действие'
correct_phone = 'Это не похоже на номер телефона. Введите номер в международном формате (+71234567890)'
admin = 'Вы вошли с правами администратора'
cancel_text = 'Выход в главное меню'
contacts = ('ООО "Рога и Пирога"\n'
            'для связи +7 999 000 11 11\n'
            'или Roga_torti@mueil.rru\n'
            '@Все права пущены на дрова')
something_else = 'что то еще?'
not_text_enter = 'Ручки чешутся? Не понимаю ручной ввод, пользуйтесь меню:'
ready_to_order = 'Доступные к заказу торты'
ready_order = 'Какой из готовых тортов хотите заказать?'
select_shape = 'Выберете форму торта'
select_layers = 'Выберете количество слоев'
select_decor = 'Какой декор добавляем?'
select_berries = 'Какие ягоды добавить?'
select_topping = 'Какой топпинг добавить?'
individual_order = 'Формируем индивидуальный заказ'
ordering = 'Оформляем заказ'
address = 'Введите адрес доставки'

# Button text
start_button_text = ['Авторизация']
main_menu_button_text = ['Заказать', 'Проверить заказ', 'История заказов', 'Контакты']
order_buttons = ['Заказать готовый', 'Сформировать индивидуальный заказ']
pay_buttons = ['Оплатить', 'Выйти в главное меню']
